{"format": "layers-model", "generatedBy": "keras v2.18.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "2.18.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 512, 512, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input"}, "name": "input", "inbound_nodes": []}, {"class_name": "TFOpLambda", "config": {"name": "tf.nn.convolution", "trainable": true, "dtype": "float32", "function": "nn.convolution"}, "name": "tf.nn.convolution", "inbound_nodes": [["input", 0, 0, {"filters": [[[[-0.12856605648994446, 0.11871552467346191, -0.05115629360079765, 0.08111734688282013, 0.10154405981302261, -0.15103182196617126, -0.16136731207370758, 0.1539127379655838, 0.05785481631755829, -0.13405610620975494, 0.1262226700782776, 0.12671798467636108, -0.14065375924110413, -0.0945160984992981, 0.2352185696363449, 0.21523624658584595], [-0.06987348943948746, -0.29127055406570435, -0.09482768923044205, 0.16465215384960175, -0.020540587604045868, -0.26708102226257324, -0.030137337744235992, -0.10250775516033173, 0.11222849786281586, 0.14879938960075378, -0.0330924466252327, -0.05904987081885338, 0.10321508347988129, 0.06345150619745255, 0.2050546258687973, 0.20443743467330933], [-0.174849733710289, 0.10263066738843918, -0.10802163928747177, 0.15954652428627014, -0.18715797364711761, -0.057927533984184265, -0.15731105208396912, 0.3347042500972748, 0.09380785375833511, -0.0502423495054245, 0.11597266048192978, 0.09403117001056671, -0.09855812042951584, 0.0642450824379921, -0.0014833067543804646, 0.16886591911315918]], [[-0.13728275895118713, 0.25933241844177246, 0.02792094089090824, -0.2660418450832367, 0.1610390841960907, 0.16126856207847595, 0.04838923364877701, -0.003210353897884488, 0.05642741546034813, 0.047300584614276886, -0.13304464519023895, 0.18948209285736084, 0.022722430527210236, -0.26175662875175476, 0.2762322425842285, -0.32626163959503174], [-0.16370424628257751, -0.08831412345170975, -0.08768848329782486, -0.09287460893392563, -0.11383576691150665, 0.09760987758636475, 0.14179791510105133, -0.0059545161202549934, 0.1503157764673233, -0.17927560210227966, -0.16317501664161682, 0.1823424994945526, -0.041063662618398666, -0.12761908769607544, 0.0026754781138151884, -0.28492632508277893], [-0.18726518750190735, -0.031732555478811264, -0.24545370042324066, -0.021331727504730225, -0.021107232198119164, 0.10253652930259705, -0.09928451478481293, 0.04722953587770462, 0.0951128751039505, 0.06490948796272278, 0.18356411159038544, -0.0177121814340353, 0.19618335366249084, -0.10076874494552612, 0.07688827812671661, -0.35323211550712585]], [[0.027897968888282776, 0.17703434824943542, 0.06605841964483261, -0.3293585479259491, -0.02017129585146904, 0.2333858460187912, -0.014338091015815735, 0.0175342857837677, 0.11362877488136292, -0.05142237991094589, -0.198595330119133, 0.12635700404644012, -0.13505806028842926, -0.1065797433257103, 0.120387502014637, -0.11052671074867249], [-0.12071219831705093, -0.11277524381875992, 0.11938881874084473, 0.1045580804347992, 0.2082582712173462, 0.027695652097463608, 0.3289010226726532, -0.2429128736257553, 0.16508223116397858, 0.165039524435997, -0.017297465354204178, 0.15548628568649292, 0.022414976730942726, -0.17441771924495697, -0.01146577950567007, -0.05680699273943901], [-0.10700010508298874, 0.04145339876413345, -0.1721644103527069, -0.1028832271695137, -0.06810679286718369, 0.29762837290763855, 0.2648511230945587, 0.14009706676006317, 0.10357813537120819, 0.1043023094534874, -0.024371454492211342, -0.1368032991886139, -0.04273723438382149, 0.001314982888288796, 0.028018871322274208, -0.08171097189188004]]], [[[-0.15351569652557373, -0.06039738655090332, 0.08130302280187607, -0.1849222630262375, 0.13183805346488953, 0.009811864234507084, -0.06592778116464615, 0.2956293821334839, -0.16273227334022522, -0.19413267076015472, -0.17228008806705475, -0.046970464289188385, 0.09396608173847198, 0.09382985532283783, 0.0805245041847229, 0.19193464517593384], [-0.10724145174026489, -0.15032725036144257, 0.09944774955511093, 0.025812428444623947, 0.03461700677871704, 0.03978661447763443, 0.06416723877191544, 0.11526473611593246, -0.14517846703529358, -0.09084750711917877, 0.13304291665554047, 0.08869700133800507, 0.054924555122852325, 0.003954681567847729, 0.2101217359304428, 0.19681952893733978], [-0.04378358647227287, -0.2742172181606293, -0.037882301956415176, -0.03849472105503082, -0.11036165058612823, 0.04336380586028099, -0.22849483788013458, 0.12429957091808319, -0.1545082926750183, -0.15555213391780853, 0.19798694550991058, -0.005537902470678091, 0.08772125095129013, 0.020709749311208725, 0.055167924612760544, 0.2667566239833832]], [[-0.05362773314118385, 0.05993282049894333, -0.027415478602051735, -0.4403168857097626, 0.0550805926322937, 0.21834947168827057, -0.17261075973510742, -0.04022064432501793, -0.3138427138328552, -0.3822895884513855, -0.20124171674251556, 0.09403262287378311, 0.2021319419145584, -0.2805260717868805, 0.031223546713590622, -0.20688262581825256], [-0.02406822331249714, -0.2626422047615051, 0.19872315227985382, -0.04445331171154976, 0.028915418311953545, 0.05190751701593399, 0.06316801905632019, -0.12218357622623444, -0.356925904750824, -0.2659681737422943, 0.13098151981830597, 0.15996159613132477, 0.33181944489479065, -0.2999672293663025, 0.31185686588287354, -0.20641665160655975], [-0.03940592706203461, 0.05140720680356026, -0.2609388828277588, -0.18233038485050201, -0.16024254262447357, 0.28660786151885986, 0.048636503517627716, 0.10847795009613037, -0.33762574195861816, -0.135886549949646, -0.05273714289069176, 0.1438589245080948, 0.435430645942688, -0.006577607244253159, 0.12475278973579407, -0.13638372719287872]], [[0.1532270610332489, 0.2800689935684204, -0.0009327413863502443, -0.27763208746910095, 0.0039741648361086845, 0.2106890082359314, 0.18059705197811127, -0.23406991362571716, 0.13886794447898865, -0.040496908128261566, -0.18453562259674072, 0.004747054073959589, 0.18876425921916962, -0.13381431996822357, 0.07998597621917725, 0.19775831699371338], [-0.024043668061494827, -0.14341644942760468, 0.17742116749286652, -0.1895228773355484, -0.12903326749801636, 0.030640702694654465, -0.03234196826815605, -0.3878922164440155, 0.1772986501455307, 0.03788625821471214, -0.1220177635550499, -0.07195895165205002, 0.11588536947965622, -0.2317759394645691, 0.08243665099143982, 0.148462176322937], [0.06515360623598099, 0.22213222086429596, -0.2106456309556961, -0.05663555487990379, -0.14775815606117249, 0.2181941568851471, 0.18758855760097504, -0.0031833341345191, 0.1727742850780487, -0.04254457354545593, 0.19578993320465088, -0.18228507041931152, 0.22484208643436432, 0.10012327134609222, 0.009281272999942303, 0.2096015214920044]]], [[[0.25375625491142273, 0.20085901021957397, -0.10208918899297714, -0.2949986755847931, -0.03680291399359703, -0.04238184913992882, -0.23031939566135406, 0.04533538222312927, 0.0701436698436737, 0.07736407965421677, 0.0055018579587340355, 0.013972990214824677, -0.039794012904167175, -0.12973552942276, 0.17542102932929993, -0.04777354374527931], [0.12514643371105194, -0.10299375653266907, 0.0594569593667984, 0.035136815160512924, 0.06457563489675522, -0.14014744758605957, -0.19358012080192566, -0.05665039271116257, 0.03269598260521889, 0.029797930270433426, 0.03521124646067619, -0.01635531708598137, -0.09313194453716278, 0.04766784608364105, 0.11822003871202469, -0.026081508025527], [-0.003593874629586935, -0.16019095480442047, -0.12691260874271393, -0.12251981347799301, -0.3224523961544037, -0.02030288055539131, -0.21004633605480194, 0.1866253763437271, 0.0315120592713356, -0.004993361886590719, 0.024881040677428246, 0.02863818220794201, 0.15808449685573578, -0.07406623661518097, -0.20316460728645325, -0.08733547478914261]], [[0.31558212637901306, 0.08844151347875595, 0.16223618388175964, -0.22362011671066284, -0.049908388406038284, -0.10117651522159576, 0.09702649712562561, 0.18547701835632324, -0.14629991352558136, -0.027261672541499138, 0.07297797501087189, 0.21231885254383087, -0.12002737075090408, -0.09265071153640747, 0.048237599432468414, 0.15409743785858154], [0.16216613352298737, -0.2750852108001709, 0.2359040230512619, 0.11971788853406906, -0.24069738388061523, -0.20341280102729797, 0.07282651215791702, 0.004809018224477768, -0.21724633872509003, 0.1872459352016449, 0.1042938381433487, -0.05987876281142235, 0.21667253971099854, -0.1006210595369339, -0.020940368995070457, 0.19392597675323486], [-0.07441188395023346, 0.14204435050487518, -0.1556197851896286, -0.09951011091470718, -0.49484437704086304, 0.01970313861966133, -0.19141240417957306, 0.1862567812204361, -0.17679353058338165, 0.23234660923480988, 0.16092321276664734, 0.014061826281249523, -0.05073215439915657, 0.07531419396400452, 0.0064590186811983585, 0.10096079856157303]], [[0.07374057918787003, 0.07960082590579987, -0.023310603573918343, -0.054984673857688904, -0.19453276693820953, 0.012625875882804394, -0.06110609322786331, -0.1201183870434761, 0.13825568556785583, 0.09944053739309311, -0.05628925561904907, 0.059401966631412506, 0.04284136742353439, -0.06678212434053421, 0.06463349610567093, 0.003979191649705172], [0.18930581212043762, 0.12304473668336868, 0.14469721913337708, 0.10476132482290268, -0.2679907977581024, -0.07300454378128052, 0.06944097578525543, -0.3839540481567383, 0.17235979437828064, 0.19402764737606049, 0.15230989456176758, 0.22413042187690735, -0.13379190862178802, -0.2095503807067871, 0.10899770259857178, 0.03745688125491142], [-0.1068216934800148, 0.011543955653905869, 0.11038067191839218, -0.020815987139940262, -0.40093883872032166, 0.001868567313067615, -0.07875733822584152, -0.2270396649837494, 0.09202611446380615, 0.18329547345638275, 0.16260261833667755, -0.044407326728105545, 0.029182564467191696, -0.13029390573501587, -0.1217377781867981, -0.06693747639656067]]]], "strides": [1, 1], "padding": "SAME", "dilations": [1, 1]}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.add", "trainable": true, "dtype": "float32", "function": "math.add"}, "name": "tf.math.add", "inbound_nodes": [["tf.nn.convolution", 0, 0, {"y": [0.22172096371650696, 0.1246759295463562, 0.0879652351140976, 0.06108652427792549, 0.2689244747161865, -0.19629260897636414, 0.0724678486585617, -0.10130993276834488, 0.42384159564971924, 0.21947923302650452, 0.01951291412115097, -0.2109338641166687, -0.006985502317547798, 0.20853352546691895, -0.06736262142658234, -0.005884893704205751]}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.divide", "trainable": true, "dtype": "float32", "function": "math.divide"}, "name": "tf.math.divide", "inbound_nodes": [["tf.math.add", 0, 0, {"y": 1.4142135381698608, "name": "/relu/Div"}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.erf", "trainable": true, "dtype": "float32", "function": "math.erf"}, "name": "tf.math.erf", "inbound_nodes": [["tf.math.divide", 0, 0, {"name": "/relu/Erf"}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.add_3", "trainable": true, "dtype": "float32", "function": "math.add"}, "name": "tf.math.add_3", "inbound_nodes": [["tf.math.erf", 0, 0, {"y": 1.0, "name": "/relu/Add"}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_4", "trainable": true, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_4", "inbound_nodes": [["tf.math.add", 0, 0, {"y": ["tf.math.add_3", 0, 0], "name": "/relu/Mul"}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_8", "trainable": true, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_8", "inbound_nodes": [["tf.math.multiply_4", 0, 0, {"y": 0.5, "name": "/relu/Mul_1"}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.pad", "trainable": true, "dtype": "float32", "function": "compat.v1.pad"}, "name": "tf.compat.v1.pad", "inbound_nodes": [["tf.math.multiply_8", 0, 0, {"paddings": [[0, 0], [1, 1], [1, 1], [0, 0]], "mode": "CONSTANT", "name": null, "constant_values": 0}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.nn.depthwise_conv2d", "trainable": true, "dtype": "float32", "function": "compat.v1.nn.depthwise_conv2d"}, "name": "tf.compat.v1.nn.depthwise_conv2d", "inbound_nodes": [["tf.compat.v1.pad", 0, 0, {"filter": [[[[-0.024844463914632797, -0.037730373442173004, -0.02666330710053444, 0.10323943197727203], [0.4520873427391052, -0.22881554067134857, -0.12198777496814728, 0.17816895246505737], [0.20784491300582886, -0.22667428851127625, -0.31828710436820984, -0.6857142448425293], [-0.19681838154792786, 0.48432543873786926, -0.157326340675354, -0.10039994865655899], [-0.14801381528377533, -0.3962409198284149, 0.46457934379577637, -0.12213630229234695], [-0.1444447636604309, -0.03618090972304344, 0.1541781723499298, -0.23271068930625916], [0.007554630748927593, 0.022616710513830185, -0.32663291692733765, -0.22000353038311005], [0.1352497935295105, -0.4648319184780121, 0.43343815207481384, 0.31563884019851685], [0.13022480905056, -0.10743891447782516, -0.44835302233695984, -0.019685786217451096], [0.08473534137010574, -0.022026391699910164, 0.22350862622261047, -0.1489299237728119], [-0.006069852504879236, 0.23510803282260895, 0.06315703690052032, 0.3132893443107605], [-0.01298963837325573, 0.1601072996854782, 0.11101042479276657, 0.2726861238479614], [0.1985502690076828, 0.07312171906232834, -0.39379602670669556, 0.12783439457416534], [0.44089367985725403, -0.17733940482139587, -0.15014523267745972, 0.2510294020175934], [0.363279789686203, 0.20762385427951813, -0.4331432282924652, 0.21492449939250946], [0.7059978246688843, 0.006083416752517223, -0.4888503849506378, 0.04208803176879883]], [[0.23118403553962708, 0.5561922788619995, -0.15658174455165863, 0.6031198501586914], [0.3001854121685028, 0.046006571501493454, -0.05636680871248245, -0.33532950282096863], [-0.07143688946962357, -0.0958157330751419, -0.1542292684316635, -0.14890192449092865], [-0.4400615394115448, 0.14187785983085632, -0.03298766538500786, -0.5141479969024658], [0.28916624188423157, -0.4264432489871979, 0.39024224877357483, 0.46946290135383606], [0.1777009516954422, 0.10059325397014618, 0.0799119845032692, -0.4812600016593933], [-0.1871718317270279, 0.22968405485153198, -0.25909239053726196, 0.6572949290275574], [-0.09781277179718018, -0.5097587704658508, 0.4755375385284424, 0.35526663064956665], [0.3660655617713928, -0.22645166516304016, -0.012856487184762955, 0.4897408187389374], [0.0924924835562706, -0.2970064580440521, -0.33011552691459656, 0.12280193716287613], [0.14523540437221527, -0.20446638762950897, -0.11276484280824661, -0.1855326145887375], [-0.008619188331067562, -0.2436075359582901, -0.20468759536743164, 0.3497031331062317], [0.09830327332019806, 0.17673064768314362, -0.5488698482513428, -0.26149582862854004], [0.08584432303905487, 0.5897892713546753, -0.33765149116516113, 0.04511068016290665], [0.13044039905071259, 0.030569909140467644, -0.19440853595733643, 0.07909897714853287], [-0.6069896817207336, 0.08575727790594101, -0.5851450562477112, 0.09164372831583023]], [[-0.1284359246492386, -0.21411994099617004, -0.15302036702632904, 0.48245519399642944], [0.2908443510532379, -0.26086196303367615, -0.19150865077972412, -0.3504239022731781], [0.3949659466743469, -0.057204704731702805, -0.49305057525634766, 0.25336283445358276], [-0.5013116002082825, 0.3297577500343323, -0.20386558771133423, -0.5710979700088501], [0.20035257935523987, 0.10056553781032562, 0.24017003178596497, 0.4170962870121002], [-0.026850739493966103, 0.179837167263031, 0.021546263247728348, -0.2930598556995392], [0.12131847441196442, -0.09737935662269592, 0.06403922289609909, 0.20824138820171356], [-0.5456929206848145, 0.029076674953103065, 0.1460249125957489, -0.16127105057239532], [0.2511548697948456, -0.06414123624563217, 0.22781600058078766, -0.0873325988650322], [0.1921258270740509, -0.2683185935020447, 0.2265833169221878, 0.3621990978717804], [-0.3494376540184021, 0.0717320516705513, 0.3392742872238159, -0.07683639973402023], [-0.212432861328125, 0.296308308839798, 0.03517530858516693, -0.01901303045451641], [-0.10981213301420212, 0.34041938185691833, -0.1644207388162613, -0.21368488669395447], [0.1906213015317917, 0.312435507774353, -0.2915373146533966, -0.37361541390419006], [-0.1564122885465622, 0.2745260000228882, -0.6105426549911499, 0.36426618695259094], [-0.1919466257095337, -0.08095559477806091, -0.39014387130737305, -0.2784404158592224]]], [[[0.3926086723804474, 0.17020148038864136, -0.2501785159111023, 0.061497244983911514], [0.24222856760025024, 0.13011254370212555, -0.4520498216152191, 0.4297889471054077], [0.49642178416252136, -0.046748582273721695, -0.13262248039245605, 0.04797878488898277], [0.2029801458120346, 0.4613775610923767, -0.552706778049469, 0.1430504024028778], [0.16572819650173187, 0.02997387759387493, 0.13022634387016296, 0.01797301322221756], [-0.03290946036577225, 0.028173010796308517, -0.1578485071659088, 0.2209589183330536], [-0.3677668273448944, 0.6155014634132385, 0.0058707608841359615, -0.5635077953338623], [-0.33660057187080383, 0.01989865116775036, 0.3764877915382385, -0.3761928081512451], [-0.2112296223640442, 0.28719428181648254, -0.3936760127544403, -0.32518085837364197], [0.5394141674041748, -0.08980099111795425, 0.08286742866039276, -0.09843258559703827], [-0.2048880159854889, -0.16153526306152344, 0.25604212284088135, 0.3278128504753113], [0.2985718548297882, -0.09051879495382309, -0.30450573563575745, 0.12678901851177216], [-0.13046413660049438, -0.05039520561695099, -0.4709509313106537, -0.24624556303024292], [0.32133468985557556, 0.12570756673812866, -0.36069485545158386, -0.33296698331832886], [0.04009004309773445, 0.28963878750801086, -0.8341776132583618, 0.05254215747117996], [0.3043748736381531, 0.19878527522087097, -0.36396318674087524, 0.202678844332695]], [[-0.30772534012794495, 0.26274794340133667, -0.43599915504455566, 0.5728368163108826], [0.09216173738241196, 0.4231433570384979, -0.33985164761543274, -0.1328790783882141], [0.11604516208171844, 0.31122827529907227, -0.15309974551200867, 0.3758738040924072], [-0.04203120991587639, 0.018009288236498833, 0.02806650660932064, -0.5668632984161377], [0.6500177383422852, 0.1096028983592987, -0.05767226964235306, 0.3827192187309265], [0.2749349772930145, -0.3188090920448303, -0.04164982959628105, 0.15116846561431885], [-0.19890372455120087, 0.2668810486793518, -0.33913570642471313, 0.893271803855896], [-0.5357820987701416, -0.654215931892395, -0.031148158013820648, 0.6030544638633728], [0.2899149954319, -0.22370748221874237, 0.4897083044052124, 0.3602757453918457], [0.6070379018783569, 0.27721983194351196, -0.26933950185775757, 0.1645742952823639], [0.08573755621910095, 0.0971827581524849, -0.16235344111919403, 0.09082701057195663], [0.21242479979991913, 0.34979048371315, -0.1406179666519165, 0.050727326422929764], [0.1850081980228424, -0.03983593359589577, -0.19525423645973206, -0.18179215490818024], [0.2732255160808563, 0.44025227427482605, -0.38660117983818054, -0.4214280843734741], [0.09289418160915375, -0.1272384524345398, -0.7174340486526489, -0.16651196777820587], [-0.5456223487854004, 0.16831719875335693, -0.6929370164871216, -0.2511942684650421]], [[-0.36664333939552307, -0.544153094291687, -0.34043994545936584, 0.019236024469137192], [0.2035588026046753, 0.05589154362678528, -0.3215279281139374, 0.022539697587490082], [-0.028732458129525185, 0.408525288105011, -0.5597658753395081, 0.3137912452220917], [-0.16676898300647736, 0.5272020101547241, -0.38154327869415283, 0.021794576197862625], [0.4054824113845825, 0.09921538084745407, 0.5249065160751343, 0.550841212272644], [0.07520783692598343, 0.09068427234888077, 0.28769585490226746, 0.07859423011541367], [-0.09450428187847137, -0.02465413138270378, -0.23807016015052795, 0.5663414001464844], [-0.4478715658187866, -0.29809311032295227, 0.4026280641555786, -0.1878870129585266], [0.5283381938934326, -0.6192810535430908, 0.2545035779476166, -0.4733525216579437], [-0.04444435238838196, -0.15962761640548706, -0.2919742166996002, 0.15086644887924194], [0.3876258134841919, 0.3891798257827759, 0.3611864447593689, 0.21550537645816803], [-0.36477896571159363, 0.07680973410606384, -0.07417318224906921, 0.25956952571868896], [0.27286192774772644, 0.07423900067806244, -0.21888984739780426, -0.281800776720047], [0.5000423192977905, 0.37195008993148804, -0.5360323190689087, 0.1252380609512329], [-0.3417890965938568, -0.047075849026441574, -0.757043719291687, -0.30575817823410034], [0.38379400968551636, 0.0019315800163894892, -0.4448375403881073, -0.550849974155426]]], [[[-0.06070442497730255, -0.1916034072637558, -0.35869407653808594, -0.3699776232242584], [0.029858998954296112, 0.3008281886577606, -0.35733717679977417, 0.4889237582683563], [0.040745675563812256, 0.3131749927997589, -0.1792464405298233, -0.2716967463493347], [0.2511773705482483, -0.007574168965220451, -0.12542521953582764, -0.03783867135643959], [0.340832382440567, -0.24791674315929413, 0.5143930315971375, 0.07331790775060654], [0.07342305034399033, 0.15706519782543182, 0.04603494331240654, 0.4440199136734009], [-0.18122434616088867, 0.5511984825134277, 0.00851370207965374, -0.5495337843894958], [-0.35435283184051514, -0.19284839928150177, -0.15382912755012512, -0.41442620754241943], [-0.2949148416519165, 0.4649415612220764, -0.5826271176338196, 0.4234873354434967], [0.09763070940971375, 0.4058564305305481, -0.460405558347702, 0.15914851427078247], [-0.24570973217487335, 0.08979401737451553, 0.12408852577209473, 0.3450281620025635], [-0.30799034237861633, -0.0620657280087471, 0.0683908686041832, -0.24045735597610474], [0.05744687095284462, -0.19403785467147827, -0.40262168645858765, 0.41770172119140625], [-0.08095376193523407, 0.3363003730773926, -0.3837835490703583, -0.3810200095176697], [0.04917324706912041, 0.0652545616030693, -0.5675765872001648, -0.23057159781455994], [-0.03553072363138199, 0.036258380860090256, 0.29703691601753235, -0.2776890993118286]], [[-0.40523794293403625, 0.10584764927625656, 0.16425655782222748, -0.5385679006576538], [0.11004962027072906, 0.2883407473564148, -0.5516572594642639, -0.2195204198360443], [0.07636319845914841, 0.2187473326921463, -0.1792600452899933, 0.17649370431900024], [-0.030655939131975174, 0.01277176197618246, -0.040723446756601334, 0.1818901002407074], [0.19667597115039825, 0.42766475677490234, 0.17080163955688477, 0.18330606818199158], [0.5205102562904358, -0.16963127255439758, -0.07143542915582657, 0.47450369596481323], [-0.3180850148200989, 0.04564530774950981, 0.12514947354793549, 0.7310678958892822], [-0.38683968782424927, -0.41355523467063904, 0.02192036062479019, 0.5741722583770752], [-0.31409645080566406, 0.8978060483932495, 0.4994752109050751, 0.5898683071136475], [0.14282284677028656, -0.33004480600357056, -0.16435958445072174, 0.43637531995773315], [0.07221345603466034, 0.1543266624212265, -0.6044349074363708, 0.40880680084228516], [-0.08677057921886444, 0.1828421652317047, 0.3072762191295624, 0.11402709782123566], [0.17704442143440247, -0.4518667757511139, -0.42322245240211487, 0.12713415920734406], [0.5409000515937805, 0.6103338599205017, 0.007166073191910982, -0.028022943064570427], [0.3431437015533447, -0.1754474937915802, -0.9363881945610046, -0.1690824180841446], [-0.2583500146865845, 0.34386515617370605, -0.13620392978191376, -0.17466096580028534]], [[-0.5504400730133057, -0.3551698625087738, -0.18516090512275696, -0.6403018236160278], [0.03674772009253502, 0.3221953809261322, -0.3247718811035156, 0.24656705558300018], [0.37189972400665283, 0.16651099920272827, -0.5242791175842285, -0.42809543013572693], [-0.5495999455451965, 0.310507595539093, -0.19669285416603088, 0.42474865913391113], [0.5061314702033997, 0.41158294677734375, -0.056901849806308746, -0.11264590919017792], [0.1415906697511673, -0.1841578334569931, -0.11614275723695755, -0.00010402279440313578], [0.3513149321079254, 0.21581433713436127, -0.34159237146377563, 0.6258578896522522], [0.06733764708042145, -0.398432195186615, -0.13314880430698395, -0.15094514191150665], [-0.30000028014183044, 0.16308848559856415, 0.5934344530105591, -0.44101402163505554], [-0.17051392793655396, -0.36210939288139343, 0.014670558273792267, 0.4470459222793579], [0.14519943296909332, 0.20742079615592957, -0.3351593315601349, -0.044345349073410034], [-0.04329366981983185, 0.0806734710931778, -0.07235721498727798, -0.004657789133489132], [0.24376796185970306, -0.018405845388770103, -0.027214117348194122, 0.4676118493080139], [0.18010123074054718, 0.5247418880462646, -0.40090590715408325, -0.1468813717365265], [-0.2130286544561386, 0.2818604111671448, -0.8090948462486267, -0.056579239666461945], [0.12257655709981918, -0.013975508511066437, -0.29107052087783813, -0.5234785676002502]]]], "strides": [1, 2, 2, 1], "padding": "VALID", "rate": [1, 1], "name": null, "data_format": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.add_4", "trainable": true, "dtype": "float32", "function": "math.add"}, "name": "tf.math.add_4", "inbound_nodes": [["tf.compat.v1.nn.depthwise_conv2d", 0, 0, {"y": [-0.14812569320201874, 0.08572878688573837, 0.0030152490362524986, -0.04842405393719673, -0.11186829954385757, 0.07197980582714081, 0.1057250127196312, -0.11977861821651459, 0.00207529217004776, 0.10417832434177399, -0.09063034504652023, 0.1161978542804718, -0.20963598787784576, 0.19313597679138184, -0.01717241108417511, -0.11764165759086609, -0.06369692087173462, -0.03978130966424942, 0.1406875103712082, 0.0683678686618805, -0.0787348672747612, 0.18937411904335022, -0.09376370906829834, -0.043192826211452484, 0.14967669546604156, 0.11954768747091293, -0.14073561131954193, -0.023517947643995285, -0.18314485251903534, 0.017012402415275574, 0.1706581562757492, 0.13755060732364655, -0.07764085382223129, -0.15615122020244598, 0.10152718424797058, -0.2113785743713379, 0.038303446024656296, -0.1565992385149002, -0.04519341140985489, 0.0642966479063034, 0.13565665483474731, 0.09218703955411911, 0.005958070047199726, 0.09949397295713425, 0.3007063567638397, -0.0039080348797142506, 0.19930942356586456, 0.05045530945062637, -0.29832130670547485, 0.11753550916910172, 0.2465939223766327, 0.029256220906972885, -0.0969693511724472, 0.11693328619003296, -0.09001187235116959, 0.026171669363975525, -0.24963681399822235, -0.4117349088191986, -0.055740971118211746, 0.29575228691101074, 0.054943494498729706, 0.15774627029895782, 0.08130758255720139, 0.11963916569948196]}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.divide_1", "trainable": true, "dtype": "float32", "function": "math.divide"}, "name": "tf.math.divide_1", "inbound_nodes": [["tf.math.add_4", 0, 0, {"y": 1.4142135381698608, "name": "/relu_1/Div"}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.erf_1", "trainable": true, "dtype": "float32", "function": "math.erf"}, "name": "tf.math.erf_1", "inbound_nodes": [["tf.math.divide_1", 0, 0, {"name": "/relu_1/Erf"}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.add_7", "trainable": true, "dtype": "float32", "function": "math.add"}, "name": "tf.math.add_7", "inbound_nodes": [["tf.math.erf_1", 0, 0, {"y": 1.0, "name": "/relu_1/Add"}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_13", "trainable": true, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_13", "inbound_nodes": [["tf.math.add_4", 0, 0, {"y": ["tf.math.add_7", 0, 0], "name": "/relu_1/Mul"}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_17", "trainable": true, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_17", "inbound_nodes": [["tf.math.multiply_13", 0, 0, {"y": 0.5, "name": "/relu_1/Mul_1"}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.nn.convolution_1", "trainable": true, "dtype": "float32", "function": "nn.convolution"}, "name": "tf.nn.convolution_1", "inbound_nodes": [["tf.math.multiply_17", 0, 0, {"filters": [[[[0.04319305345416069, 0.009707270190119743, 0.14450009167194366, 0.014968943782150745, -0.049636103212833405, 0.10678493976593018, 0.03713251277804375, 0.1569111943244934, -0.016927499324083328, -0.044826921075582504, -0.02971610799431801, -0.01619044877588749, 0.013159027323126793, 0.03537566959857941, -0.027825377881526947, 0.0471535325050354, -0.010256779380142689, -0.04796493425965309, 0.103456050157547, 0.06278939545154572, 0.08382207155227661, 0.07212720066308975, 0.029059704393148422, -0.03599477559328079, 0.06562028080224991, 0.030528878793120384, -0.06132285296916962, -0.0464942529797554, -0.12334546446800232, -0.011265083216130733, 0.022093111649155617, -0.0900827944278717, -0.039514102041721344, -0.08318626880645752, 0.08268734812736511, -0.008397362194955349, 0.12863938510417938, -0.037396445870399475, 0.06655537337064743, 0.056672338396310806, 0.021646708250045776, -0.15484394133090973, 0.03316251188516617, 0.21372923254966736, -0.00864371657371521, 0.10829326510429382, 0.1572725623846054, 0.0392635278403759, -0.04597478732466698, 0.0969826728105545, -0.10711746662855148, 0.0648428276181221, 0.021241921931505203, -0.019040558487176895, 0.009931824170053005, 0.055490463972091675, -0.08935777842998505, 0.10976528376340866, -0.011902395635843277, 0.03784309700131416, -0.01663036458194256, 0.05457758158445358, 0.10382092744112015, -0.063254214823246], [-0.03314108029007912, 0.09384983777999878, -0.07157421857118607, 0.00968972034752369, 0.03219049051403999, -0.1873854100704193, 0.019771110266447067, -0.11115610599517822, -0.06799932569265366, -0.019905662164092064, 0.402024507522583, 0.07392319291830063, 0.03452679514884949, -0.006682374514639378, -0.025323757901787758, 0.06063562259078026, 0.08622737228870392, -0.007825254462659359, -0.03991308808326721, 0.03428875282406807, -0.07019850611686707, 0.09661497920751572, 0.057969678193330765, 0.08016285300254822, -0.08902671933174133, 0.08328453451395035, -0.003619892057031393, -0.08875341713428497, 0.1385403275489807, 0.1378520429134369, -0.04674209654331207, 0.07300183922052383, 0.0002580645668786019, -0.07565562427043915, -0.07517798990011215, 0.17122894525527954, 0.1419871747493744, -0.015793917700648308, -0.03268837556242943, -0.07621344178915024, 0.014067286625504494, -0.16571848094463348, -0.07245472073554993, -0.0789533257484436, 0.05224773660302162, -0.08871622383594513, -0.10046739131212234, -0.06658089905977249, 0.016952786594629288, -0.0686982199549675, 0.13190768659114838, 0.0020984343718737364, -0.050104424357414246, 0.0820288136601448, -0.0005287795793265104, -0.06813192367553711, 0.10133961588144302, -0.14662383496761322, -0.0222026240080595, 0.05521901696920395, -0.08937640488147736, 0.11879364401102066, 0.03566228970885277, 0.11233396083116531], [0.040591973811388016, -0.08382011204957962, 0.20152564346790314, 0.1878681629896164, 0.01229790598154068, 0.18482324481010437, 0.006090170703828335, 0.2908913493156433, 0.03171882405877113, 0.012525818310678005, -0.12610174715518951, 0.06613415479660034, 0.0003099429013673216, -0.04815293475985527, -0.036095283925533295, -0.12851105630397797, -0.14296846091747284, 0.0686715692281723, -0.11692485958337784, 0.04363894462585449, 0.017893148586153984, -0.10741618275642395, 0.014061756432056427, -0.08124951273202896, -0.004055941477417946, 0.023351306095719337, 0.061952315270900726, -0.009968552738428116, 0.0479920394718647, -0.09862712770700455, 0.028235921636223793, -0.03256065025925636, 0.043863940984010696, -0.09392610937356949, 0.0682956650853157, -0.11889735609292984, -0.1309536099433899, -0.032298579812049866, 0.005568242631852627, 0.0748579129576683, 0.0012913546524941921, -0.05153962969779968, -0.014230649918317795, 0.04239553213119507, -0.07915057986974716, 0.06759404391050339, 0.19181732833385468, 0.02028425969183445, -0.10090284794569016, 0.04552528262138367, 0.0399390384554863, 0.03217481076717377, -0.004507244098931551, -0.06574679166078568, -0.04727715998888016, 0.07911928743124008, -0.07556132972240448, 0.08414348214864731, 0.07434606552124023, 0.015290351584553719, -0.022230114787817, 0.16802309453487396, 0.10164067894220352, -0.0026111863553524017], [-0.1273883879184723, 0.10987264662981033, 0.03302605077624321, 0.21447736024856567, -0.1785777360200882, -0.05222998186945915, 0.04775238409638405, -0.17341463267803192, -0.1273878812789917, -0.08115585148334503, -0.0764593705534935, -0.03244302421808243, 0.2043028622865677, 0.1875941902399063, -0.5346765518188477, 0.2036665976047516, 0.09886953979730606, -0.16752858459949493, 0.08066455274820328, 0.06541595607995987, 0.13795289397239685, 0.1186201348900795, -0.010259288363158703, -0.07449016720056534, -0.08573122322559357, -0.20076240599155426, -0.471510648727417, -0.15303485095500946, -0.04545195773243904, -0.06917297840118408, -0.024181151762604713, 0.0202792901545763, -0.035594116896390915, -0.1203501895070076, 0.3359694182872772, -0.0022461528424173594, 0.0538274310529232, -0.096319280564785, -0.3584893047809601, -0.05406981706619263, 0.03537850081920624, -0.5121235251426697, -0.06820724159479141, 0.17893904447555542, -0.021653300151228905, 0.23966552317142487, 0.055894847959280014, -0.024394318461418152, 0.2028447836637497, 0.16000996530056, -0.0802091583609581, 0.0979669988155365, 0.16773882508277893, 0.10143359750509262, -0.009696322493255138, -0.03239503875374794, -0.046842195093631744, -0.17474035918712616, 0.09100517630577087, 0.24087338149547577, -0.17057611048221588, -0.06634572893381119, 0.09334038943052292, 0.18028035759925842], [0.010238155722618103, 0.19355523586273193, -0.03370268642902374, 0.037134598940610886, -0.0004914658493362367, -0.22032414376735687, -0.1088503822684288, 0.03108850307762623, 0.05107785388827324, -0.1294904500246048, 0.1480259746313095, 0.05216819792985916, -0.1086324080824852, 0.07136158645153046, -0.15655134618282318, 0.1542196273803711, 0.16024211049079895, -0.1948542296886444, 0.10144274681806564, -0.03133384510874748, 0.04890105873346329, 0.17258310317993164, -0.10677586495876312, 0.04445566609501839, -0.015402175486087799, -0.0007159922970458865, -0.10003822296857834, -0.06358807533979416, -0.12164679914712906, 0.13008102774620056, 0.0576372928917408, 0.15270940959453583, -0.13253915309906006, 0.005474376026540995, 0.1634000539779663, 0.14858931303024292, -0.030898334458470345, 0.05255202203989029, 0.03871767595410347, -0.08477640151977539, -0.03376399725675583, -0.13237683475017548, 0.08466175943613052, -0.11465965211391449, -0.21332788467407227, 0.28694188594818115, -0.4390907883644104, -0.07838529348373413, 0.02323056384921074, -0.17134296894073486, 0.13938745856285095, -0.05059933289885521, -0.05077660083770752, 0.05216129496693611, -0.08768478780984879, 0.21041744947433472, 0.18749283254146576, -0.19859668612480164, 0.05619433894753456, 0.034689806401729584, -0.017757214605808258, 0.30646008253097534, -0.07666923850774765, 0.1694091260433197], [0.011168304830789566, 0.1668986678123474, -0.11522538959980011, -0.07177963107824326, -0.012748178094625473, -0.36772584915161133, -0.0314338393509388, -0.11641941219568253, 0.0538930706679821, -0.06351633369922638, 0.0878668949007988, 0.03791444003582001, 0.0491170659661293, 0.08319449424743652, -0.06189248710870743, -0.008736001327633858, 0.2321481853723526, -0.11740878969430923, -0.006483504548668861, 0.021212570369243622, -0.054248347878456116, 0.03356032073497772, 0.027891436591744423, 0.09144701808691025, -0.02744556963443756, 0.03501151502132416, 0.0007689661579206586, 0.02865368127822876, 0.006276154424995184, 0.060154885053634644, 0.03321211785078049, 0.2056395709514618, -0.006422215141355991, -0.0628497377038002, -0.06034025177359581, 0.0973062738776207, -0.1427605003118515, 0.08126191794872284, 0.05706503614783287, -0.0031138428021222353, -0.0062983231619000435, -0.12494261562824249, 0.013411448337137699, -0.062416691333055496, 0.0268991831690073, 0.004714957904070616, -0.3505246937274933, -0.08648128807544708, -0.0884568989276886, -0.06830796599388123, 0.19175823032855988, -0.13596700131893158, -0.06436993926763535, 0.03728942573070526, 0.018238086253404617, -0.043896667659282684, 0.09040948003530502, -0.2177785485982895, -0.05297950282692909, 0.016194410622119904, -0.04002239927649498, 0.18672260642051697, -0.08261407911777496, 0.09766516089439392], [-0.015155314467847347, -0.177622452378273, 0.12858617305755615, 0.25688377022743225, -0.08273810148239136, 0.5990756750106812, -0.067109614610672, 0.2917499840259552, 0.0441024973988533, 0.08310746401548386, -0.06207561865448952, -0.11869581043720245, -0.14333905279636383, -0.1315218061208725, 0.015637079253792763, 0.12085559964179993, -0.07557752728462219, 0.1473788172006607, -0.049736667424440384, 0.20053492486476898, 0.04994042217731476, -0.13001134991645813, 0.213149294257164, -0.07722911983728409, 0.03289731591939926, 0.02934236451983452, 0.024928199127316475, 0.21068230271339417, 0.201877623796463, -0.03519561514258385, -0.028405889868736267, -0.27716222405433655, 0.02941824123263359, 0.0929499939084053, 0.10301976650953293, 0.035642966628074646, -0.030448345467448235, -0.1417706459760666, -0.0922483503818512, -0.16894222795963287, 0.09596719592809677, 0.14582185447216034, 0.03941221907734871, 0.07493209838867188, 0.031079348176717758, 0.0035200759302824736, 0.4233269989490509, 0.1389636993408203, 0.039942022413015366, 0.19102343916893005, -0.13059620559215546, 0.03828469291329384, 0.16730253398418427, -0.02588103897869587, -0.1688258945941925, 0.14880530536174774, -0.06668539345264435, 0.01077835913747549, -0.04530569165945053, 0.19651441276073456, 0.10727076232433319, 0.43385204672813416, 0.20690299570560455, -0.1003628745675087], [-0.11986986547708511, 0.03056507743895054, 0.1763470470905304, 0.11197203397750854, 0.017805904150009155, 0.10181815922260284, 0.040328625589609146, 0.09851739555597305, 0.08346819132566452, -0.012686513364315033, 0.14005038142204285, -0.05744369328022003, -0.013853934593498707, -0.008870775811374187, 0.001960561377927661, 0.2370571345090866, -0.1580975204706192, -0.03154539316892624, 0.07872900366783142, 0.03808808699250221, 0.0727839395403862, 0.09883034974336624, -0.02927800454199314, 0.025959918275475502, 0.0568559430539608, -0.151216521859169, 0.013450630009174347, -0.008700589649379253, 0.08862866461277008, 0.11700454354286194, 0.06240357458591461, -0.034270621836185455, -0.005834043025970459, -0.030216725543141365, 0.10314618051052094, -0.02902057208120823, -0.019821539521217346, 0.011494903825223446, 0.04792553558945656, -0.0331585668027401, 0.007130853831768036, 0.04302319511771202, 0.08623066544532776, 0.1270984411239624, 0.014811391942203045, 0.1339975744485855, 0.064073845744133, 0.03793735057115555, -0.07427439093589783, 0.046105485409498215, -0.02648228406906128, 0.004588820971548557, 0.03679617494344711, -0.02970789559185505, 1.0275549300331477e-07, 0.08966565132141113, -0.07241643220186234, 0.1086326390504837, 0.04442090913653374, 0.014641527086496353, 0.03028215281665325, 0.09638933837413788, 0.0568169467151165, -0.09420307725667953], [-0.001187927438877523, -0.05378608778119087, -0.19321326911449432, 0.20550936460494995, -0.05117596685886383, -0.10522967576980591, 0.051760006695985794, -0.13571247458457947, -0.03311913460493088, 0.04858257621526718, 0.28728511929512024, -0.04205923154950142, -0.021315090358257294, 0.04231216385960579, -0.1208241656422615, 0.14347374439239502, 0.14791369438171387, 0.00019235015497542918, 0.10231750458478928, 0.007028394378721714, -0.051240429282188416, 0.5091785192489624, 0.4186162054538727, 0.013208120130002499, 0.1871758997440338, -0.15073145925998688, -0.23112192749977112, -0.03884873911738396, -0.2235523760318756, 0.10330509394407272, 0.025514520704746246, 0.059407223016023636, -0.04195952042937279, -0.03314321115612984, -0.031029371544718742, 0.1494540274143219, -0.11129020899534225, 0.005593053065240383, -0.06345546245574951, -0.4222921133041382, -0.058199845254421234, 0.15376858413219452, 0.07747983932495117, -0.01567215286195278, -0.003214088501408696, -0.06767404079437256, -0.03832925483584404, 0.011779711581766605, 0.035015080124139786, 0.09676700830459595, 0.11535272747278214, 0.020853819325566292, 0.09071382135152817, -0.016257943585515022, 0.06763455271720886, -0.04048597067594528, 0.14796054363250732, -0.1532239317893982, -0.06177138909697533, -0.25052833557128906, -0.059376198798418045, 0.0384584404528141, -0.08210782706737518, 0.09732042998075485], [0.013522774912416935, -0.005709763616323471, -0.2159052938222885, -0.19680845737457275, -0.056397370994091034, -0.09386555105447769, -0.04729132354259491, -0.16594474017620087, 0.014187641441822052, 0.011456427164375782, 0.1689157634973526, -0.03348877280950546, -0.042199887335300446, 0.041658323258161545, -0.0437939316034317, 0.08827245235443115, 0.0230195764452219, -0.016069727018475533, 0.03997109830379486, -0.015028474852442741, -0.18622364103794098, 0.14392782747745514, 0.1270066797733307, -0.044737961143255234, -0.0244882944971323, -0.16172969341278076, -0.11153604090213776, 0.002585851587355137, -0.02611861750483513, 0.14020395278930664, -0.01007755659520626, 0.0660143494606018, 0.021567652001976967, -0.045072879642248154, -0.1283980756998062, -0.03550998494029045, -0.03450946882367134, -0.03212006762623787, -0.08292587846517563, -0.18137463927268982, -0.12111393362283707, 0.17276042699813843, 0.06700707972049713, -0.16271837055683136, -0.011318549513816833, -0.012083823792636395, -0.07115970551967621, -0.1023361012339592, -0.046921927481889725, -0.021337132900953293, 0.04228712245821953, -0.040712740272283554, 0.064578577876091, -0.020476706326007843, -0.00864159781485796, -0.04354018718004227, 0.03528987988829613, -0.14854736626148224, -0.02430390752851963, -0.11844803392887115, 0.016766421496868134, 0.021168695762753487, -0.04159834608435631, 0.07616651803255081], [-0.052288882434368134, -0.09223970770835876, 0.10865172743797302, 0.3755246102809906, 0.06622571498155594, 0.2586860954761505, -0.08420086652040482, 0.19440124928951263, 0.10829528421163559, -0.050250355154275894, -0.17549394071102142, 0.07549624145030975, 0.04144439101219177, -0.11615759879350662, 0.11762525141239166, -0.1831492781639099, -0.14208579063415527, 0.1399884968996048, -0.23139174282550812, 0.05816527456045151, 0.15453045070171356, -0.15608029067516327, -0.19411787390708923, -0.06716873496770859, -0.14833322167396545, 0.28789371252059937, 0.06866243481636047, 0.08990779519081116, -0.012243326753377914, -0.06956170499324799, 0.05964073911309242, 0.030199678614735603, -0.019639883190393448, -0.033965084701776505, 0.10747850686311722, 0.015264259651303291, -0.15564148128032684, 0.017940305173397064, 0.07254648953676224, 0.14953447878360748, 0.16039042174816132, -0.1468377262353897, -0.03305082768201828, 0.1208646297454834, -0.17703062295913696, 0.020404238253831863, 0.09722788631916046, 0.07759886980056763, 0.07415426522493362, -0.18005529046058655, -0.17225179076194763, 0.03229006379842758, -0.17118750512599945, 0.0016313910018652678, -0.06865659356117249, 0.06266792118549347, 0.012829288840293884, 0.08582228422164917, -0.052133262157440186, 0.19548460841178894, 0.048958469182252884, 0.13089388608932495, 0.11707175523042679, -0.012354465201497078], [0.054669201374053955, 0.07384104281663895, -0.12884151935577393, -0.2532999515533447, 0.022967757657170296, -0.07592808455228806, 0.05962629243731499, -0.1306137889623642, -0.025287948548793793, 0.05541537329554558, 0.02342185191810131, 0.04449461027979851, 0.025112604722380638, 0.007806738372892141, 0.02598833292722702, -0.16789621114730835, -0.010842371731996536, 0.028508776798844337, -0.02105802670121193, -0.036129679530858994, -0.03511199355125427, -0.17586639523506165, 0.017555756494402885, -0.020988745614886284, -0.07551353424787521, 0.00017781226779334247, -0.03165081515908241, -0.01552143506705761, -0.1438300907611847, 0.0056477864272892475, -0.028108661994338036, 0.02213135175406933, -0.005095259286463261, -0.09846293926239014, -0.11089923977851868, 0.0349835641682148, -0.038564473390579224, 0.02198021672666073, 0.01894242875277996, -0.057760220021009445, -0.011894294060766697, 0.3838497996330261, -0.07716799527406693, -0.07315470278263092, 0.019770557060837746, 0.02255387045443058, -0.09678307920694351, -0.051405034959316254, -0.17781978845596313, -0.006137121003121138, 0.047419335693120956, -0.07527652382850647, 0.004549209028482437, 0.03465946763753891, -0.037730470299720764, -0.04986494034528732, 0.10063895583152771, -0.13933680951595306, 0.014845079742372036, 0.051957424730062485, -0.017104625701904297, -0.06117497384548187, -0.044119592756032944, 0.0761973038315773], [0.016481997445225716, -0.02747020684182644, 0.028771597892045975, -0.1712302416563034, -0.060787711292505264, 0.031026534736156464, 0.04336879774928093, 0.11910366266965866, 0.05703731253743172, -0.02967631258070469, 0.006613242905586958, -0.06303615868091583, 0.03129233419895172, -0.02826308272778988, 0.025735419243574142, 0.030457163229584694, -0.06087641417980194, -0.06306613981723785, 0.004915059078484774, 0.013717018067836761, 0.0759982094168663, 0.026725413277745247, -0.020020492374897003, -0.07441890984773636, 0.04291054978966713, -0.029520368203520775, -0.09509899467229843, 0.0021742277313023806, -0.11830048263072968, -0.006130887195467949, 0.00886555016040802, -0.06629520654678345, 0.10850659757852554, -0.014323004521429539, 0.10574495792388916, 0.02133174054324627, 0.1443648636341095, 0.024928994476795197, -0.013942208141088486, 0.04468125104904175, 0.022157661616802216, -0.17269307374954224, 0.040680598467588425, 0.04563300311565399, 0.030833175405859947, 0.1234113946557045, -0.0009373494540341198, 0.0624086819589138, 0.02764413133263588, -0.009252546355128288, -0.026143144816160202, 0.001636970671825111, 0.07985561341047287, -0.04825815185904503, -0.04867278039455414, 0.05231412872672081, -0.034578803926706314, 0.08012272417545319, 0.016624439507722855, 0.027790067717432976, -0.026233436539769173, -0.08023515343666077, -0.027312196791172028, -0.09784959256649017], [-0.15378394722938538, -0.44140681624412537, 0.15759806334972382, 0.17976035177707672, -0.06599205732345581, 0.3018650412559509, 0.01938183419406414, 0.0011876639910042286, 0.05378028377890587, 0.11841052025556564, 0.01668655127286911, -0.10271570086479187, 0.048431072384119034, 0.4820272624492645, 0.21219241619110107, 0.02261558547616005, -0.014967243187129498, 0.12869814038276672, 0.2033052146434784, 0.03171415999531746, -0.0086368964985013, -0.14071618020534515, -0.035629767924547195, -0.08305077254772186, -0.009225516580045223, -0.06001240760087967, 0.027962198480963707, 0.3386751115322113, -0.006258122157305479, 0.05890171602368355, 0.2215249091386795, -0.0508669912815094, 0.18938633799552917, -0.12752066552639008, 0.006002680864185095, 0.07800561934709549, -0.1675814539194107, -0.0004306875925976783, -0.09267228841781616, -0.1729286015033722, 0.04028546065092087, 0.023562468588352203, 0.05258295312523842, 0.08681677281856537, 0.029420441016554832, 0.026982832700014114, 0.3127388656139374, -0.019986838102340698, 0.2572654187679291, 0.13225524127483368, -0.20072753727436066, -0.06127030402421951, -0.033037859946489334, 0.017892030999064445, 0.005464926827698946, 0.09071006625890732, 0.06627973169088364, 0.13410604000091553, -0.050608906894922256, 0.23942838609218597, 0.1396804302930832, 0.21240325272083282, -0.09383828938007355, -0.046726927161216736], [-0.0119343725964427, 0.1701371967792511, -0.21879544854164124, -0.036145810037851334, 0.039978962391614914, -0.4499495327472687, -0.03309016302227974, -0.06585738807916641, -0.07785049080848694, -0.09030736982822418, 0.007654854096472263, 0.06873037666082382, 0.016266008839011192, -0.22191466391086578, -0.06396739929914474, 0.0332556813955307, 0.02926677279174328, -0.039935387670993805, -0.2647537291049957, -0.04841293394565582, -0.1676236391067505, -0.04844057932496071, -0.044362179934978485, 0.013883317820727825, -0.13153190910816193, -0.15500211715698242, 0.07101025432348251, -0.14934960007667542, 0.19988317787647247, 0.011586634442210197, -0.13723425567150116, 0.1363476663827896, -0.04583759605884552, 0.07268859446048737, -0.09589678049087524, 0.025183457881212234, -0.016989687457680702, -0.00020401533402036875, -0.006085698027163744, 0.07344609498977661, -0.06964439898729324, 0.08192741870880127, -0.17454367876052856, -0.14173409342765808, 0.03228956460952759, -0.06122516095638275, -0.26950591802597046, -0.14085263013839722, 0.08501598238945007, -0.16795489192008972, 0.12350142002105713, 0.00578031362965703, -0.11633864790201187, 0.02747339755296707, -0.022724077105522156, -0.14089259505271912, 0.04290979355573654, -0.27177608013153076, -0.038175635039806366, -0.0735182985663414, -0.1010511964559555, -0.0875728577375412, 0.01705092564225197, 0.4377181828022003], [0.1892135888338089, 0.06395845860242844, -0.042110901325941086, -0.2167832851409912, 0.06493861228227615, -0.09053456783294678, -0.020806962624192238, 0.16199423372745514, 0.03257223218679428, -0.04092824086546898, -0.16207124292850494, -0.008712812326848507, -0.0500817596912384, -0.07134759426116943, -0.22302530705928802, -0.03646978363394737, 0.3985274136066437, 0.08445338159799576, -0.019976330921053886, 0.08054745197296143, 0.029913991689682007, 0.06293416768312454, 0.039344996213912964, -0.027811894193291664, 0.11006549000740051, 0.16015803813934326, -0.23779737949371338, -0.29728296399116516, -0.017989059910178185, 0.11495742201805115, -0.0929536372423172, -0.07090886682271957, 0.11259763687849045, 0.1853039413690567, 0.09528278559446335, -0.10058654099702835, 0.26121845841407776, 0.015834541991353035, 0.10632245242595673, 0.16083937883377075, -0.04938188195228577, -0.029769079759716988, 0.15710757672786713, 0.07348742336034775, -0.12179533392190933, 0.005741856526583433, -0.19037728011608124, 0.21908894181251526, 0.11910537630319595, -0.04676435515284538, -0.3088231086730957, 0.09816859662532806, 